//--------------------------------------------------------------------------
//! @file shared_file.h
//--------------------------------------------------------------------------

#ifndef SHARED_FILE_H
#define SHARED_FILE_H

#include <stdio.h>
#include <math.h>
#include <assert.h>

//----------------------------------------------------------------------------
//!
//! @breif В структуре типа coef_and_sol хранятся коэффициенты, решения и
//! количество решений квадратного уравнения
//!
//----------------------------------------------------------------------------
struct coef_and_sol
{
	double a;
	double b;
	double c;
	double x_1;
	double x_2;
	int num_x;
};

#endif
